{
"QF 101": {
    "info": {
        "Lecture": "One 2-hour and one 1-hour lecture per week. Starts with a quiz on the WSJ, then powerpoints and videos",
        "Exams": "2-3 exams per semester",
        "Homework": "Read Wall Street Journal sections and the professors blog articles before each lecture. 2-3 projects/semester. 1 group portfolio managed throughout the semester"},
    "materials": ["The QF-specific classes only The Wall Street Journal as an additional text, but you do need a subscription"]},
"CS 135 - Discrete Structures": {
    "books": {
        "1": {
            "url": "cs135_7e.pdf",
            "name": "Discrete Mathematics and Its Applications - McGraw Hill 7th FEdition"},
        "2": {
            "url": "cs135_Schemer_4e.pdf",
            "name": "The Little Schemer - 4th Edition"}}},
"H  184 - Research Seminar II": {
    "info": {
        "Lecture": "Usually they tour the labs, but there were so many students for Spring 2015 that the removed the lecture section",
        "Exams": "One question about what your plan for the summer is"}},
"MA 221 - Differential Equations - \"DifEq\"": {
    "info": {
        "Lecture": "2 1-hour lectures per week",
        "Recitation": "2 recitations per week - review of lecture topics and practice problems, hand in homework",
        "Exams": "Exam 1 - 4 problems for 25pts each - you pretty much just need to know 4 equations and then you will do fine",
        "Homework": "2 written homeworks/week - generally 6-10 problems",
        "Final": "I havent had the final yet"},
    "books": {
        "1": {
            "url": "ma221_8e.pdf",
            "name": "Fundamental Differential Equations & Boundary Value Problems - Nagle 6th Edition"}}},
"MA 121-4 - Calc 1 & Calc 2": {
    "info": {
        "Lecture": "2 1-hour lectures per week",
        "Recitation": "1 \"workshop\" per week - do a worksheet in class, ask TA questions, get homework worksheet. 1 recitation per week - hand in homework worksheet, review of lecture concepts",
        "Exams": "3 1-hour exams, with fraternity-led and school-led reviews before",
        "Homework": "Worksheet - 1 per week - generally two problems. WileyPlus - 1 assignment/week, generally 12-15 questions, and a review before each exam, about the same length. Canvas - 1 quiz before every lecture, 2 or 3 multiple choice questions. Gradarius(Only for Calc 1) - 1 assignment per week, typically 4 questions, where you show your work online",
        "Final": "4-hours allotted time, generally takes 1.5-2.5 hours"},
    "books": {
        "1": {
            "url": "ma121-124_6e.pdf",
            "name": "Hughes-Hallett Calculus 6th Edition"}},
    "materials": ["WileyPLUS Online Course", "Gradarius Online - only for Calc 1"]},
"CH 281 - Biology": {
    "info": {
        "Lecture": "Twice a week",
        "Recitation": "Once a week. You must know the answers to a set of questions you are given on canvas beforehand and you may be asked to go to the board and answer them",
        "Exams": "3 1-hour exams, 15 percent of final grade each",
        "Homework": "Canvas- Questions you need to know for recitation(1/week) are online on the calendar. You must know the answers to the questions for each recitation, and you must uplaod a picture of your answers to all questions to canvas before the exam on those chapters. Mintap/Aplia- Tutorial Quiz and Aplia assignment for each chapter must be completed by the due dates posted",
        "Final": "4-hours allotted time, 25 percent of final grade"},
    "materials": ["MindTap Online Subscription"]},
"CH 117 - Chemistry Lab": {
    "info": {
        "Lecture": "1 Lab per week, usually about one hour of the three hour time allotment",
        "Exams": "Quizzes at the beginning of each lab",
        "Homework": "Finishing lab reports",
        "Final": "Video of one of the labs"},
    "materials": ["Lab Goggles"],
    "books": {
        "1": {
            "url": "ch117_10e.pdf",
            "name": "Chemistry Lab Manual - This book has all the lab forms and info in it. You need to print them out before every lab, they should also all be available on Canvas"}}},
"MA 188 - Seminar in Math Sciences": {
    "info": {
        "Lecture": "Professor discusses concept in discrete mathematics and example problems",
        "Exams": "Several quizzes to get additional points",
        "Homework": "Problems based on concepts from class, for correctly presenting the solution to the class you get 1 point",
        "Final": "You need 5 points to pass the class for the semester"}},
"MGT103 - Introduction to Entrepreneurial Thinking": {
    "books": {
        "1": {
            "url": "mgt103_2e.pdf",
            "name": "Running Lean 2nd Edition"}}},
"PEP111 - Mechanics": {
    "info": {
        "Lecture": "2 1-hour lectures per week",
        "Recitation": "1 2-hour recitation per week - review of lecture topics and practice problems",
        "Exams": "15 point quizzes every two weeks, you get to drop the lowest grade",
        "Homework": "MasteringPhysics - 1 online assignment/week. Im not going to say there is a javascript code that will give you all the answers... but Im not saying there isnt",
        "Final": "I havent had the final yet"},
    "books": {
        "1": {
            "url": "pep111_3e.pdf",
            "name": "Physics - Knight 3rd Edition"}},
    "materials": ["Mastering Physics Online Subscription"]},
"H  183 - Research Seminar I": {
    "info": {
        "Lecture": "Different professors come and present the research they have done"}},
"CS 188 - Seminar in Computer Science": {
    "info": {
        "Lecture": "Students present on controversial/interesting technology",
        "Homework": "Prepare your presentation for the class"}}}
