{
"E  121 - Engineering Design 1 - \"D1\"": {
    "info": {
        "Lecture": "1 3-hour lecture per week",
        "Final": "Final project - about 10 weeks of class time. Design, build, and code a robot to autonomously navigating and complete simple tasks using the Arduino programming language. Large written report. Short in-class presentation",
        "Homework": "Short readings the first few weeks, then the written report at the end"}},
"Unknown": {
    "materials": ["I dont know what class these books are for, but they arere here. If you know feel free to send an email so I know where to put them"],
    "books": {
        "1": {
            "url": "StewartCalculusConceptsandContexts4th.pdf",
            "name": "Stewart Calculus Concepts and Contexts - 4th Edition"}}},
"CH 115 - Chemistry 1": {
    "info": {
        "Lecture": "2 1-hour lectures per week. Most people stop going after 3 weeks or so, obviously people that go more generally do better",
        "Recitation": "1 recitation per week - go over topics from lecture, 10 minute quiz",
        "Exams": "3 1-hour exams",
        "Homework": "MasteringPhysics - 1 online assignment/week",
        "Final": "4 hour allotted time, generally takes 1-2.5 hour"},
    "books": {
        "1": {
            "url": "ch115_9e.pdf",
            "name": "Zumdahl Chemistry 9th Edition"}},
    "materials": ["OWLv2 Online Course - Not actually used for most recitations"]},
"E  115 - Introduction to Programming": {
    "info": {
        "Lecture": "1 hour once a week, usually finished early, the professor teaches you concepts and you program along with them",
        "Recitation": "1 1/2 hours once a week - turn in and go over homework. Attendence often not required if you finish homework and can submit it online",
        "Exams": "One midterm taken online and group collaboration is allowed and encouraged.",
        "Homework": "Make a program to fit the criteria for the week"}},
"E  245 - Circuits and Systems": {
    "info": {"Labs": "Every week labs let out early. Turn in the lab report the following week. There is a midterm and final for the lab portion. The lab is 1/3 of final grade",
    "Lecture": "Kevin Ryan + his power point slides a few times a week.",
    "Exams": "Several exams throughout the year.",
    "Homework": "A few problems from the book due every two weeks or so. There is also sometimes \"problem of the week\" that is a harder problem that you have a week or two to do. Every homework has a cover page and they are on canvas along with all slides."},
    "books":{
        "1": {
            "url": "e245_6e.pdf",
            "name" : "Electrical Engineering Principles and Applications - Sixth Edition"}}},
"QF 101": {
    "info": {
        "Lecture": "One 2-hour and one 1-hour lecture per week. Starts with a quiz on the WSJ, then powerpoints and videos",
        "Exams": "2-3 exams per semester",
        "Homework": "Read Wall Street Journal sections and the professors blog articles before each lecture. 2-3 projects/semester. 1 group portfolio managed throughout the semester"},
    "materials": ["The QF-specific classes only The Wall Street Journal as an additional text, but you do need a subscription"]},
"E  101 - Engineering Experiences": {
    "info": {
        "Lecture": "No lecture - you must attend 8 events on a list of approved events and sign in to pass for the semester",
        "Homework": "4 online modules to listen to"}},
"E  120 - Graphics": {
    "info": {
        "Lecture": "1 2-hour lecture per week",
        "Exams": "2 in-class quizzes",
        "Homework": "~1 model/week using SolidWorks to make engineering drawings",
        "Final": "Final project - 3D Model with several parts, detail drawings for each, short in-class presentation"},
    "books": {
        "1": {
            "url": "e120_4e.pdf",
            "name": "Graphics Communications for Engineers"}}},
"CS 135 - Discrete Structures": {
    "books": {
        "1": {
            "url": "cs135_7e.pdf",
            "name": "Discrete Mathematics and Its Applications - McGraw Hill 7th FEdition"},
        "2": {
            "url": "cs135_Schemer_4e.pdf",
            "name": "The Little Schemer - 4th Edition"}}},
"H  184 - Research Seminar II": {
    "info": {
        "Lecture": "Usually they tour the labs, but there were so many students for Spring 2015 that the removed the lecture section",
        "Exams": "One question about what your plan for the summer is"}},
"E  126 - Mechanics of Solids - \"Mech Solids\"": {
        "books": {
            "1": {
                "url": "e126_4e.pdf",
                "name": "Statics and Mechanics of Materials - Hibbeler 4th Edition"}}},
"MA 221 - Differential Equations - \"DifEq\"": {
    "info": {
        "Lecture": "2 1-hour lectures per week",
        "Recitation": "2 recitations per week - review of lecture topics and practice problems, hand in homework",
        "Exams": "Exam 1 - 4 problems for 25pts each - you pretty much just need to know 4 equations and then you will do fine",
        "Homework": "2 written homeworks/week - generally 6-10 problems",
        "Final": "I havent had the final yet"},
    "books": {
        "1": {
            "url": "ma221_8e.pdf",
            "name": "Fundamental Differential Equations & Boundary Value Problems - Nagle 6th Edition"}}},
"MA 121-4 - Calc 1 & Calc 2": {
    "info": {
        "Lecture": "2 1-hour lectures per week",
        "Recitation": "1 \"workshop\" per week - do a worksheet in class, ask TA questions, get homework worksheet. 1 recitation per week - hand in homework worksheet, review of lecture concepts",
        "Exams": "3 1-hour exams, with fraternity-led and school-led reviews before",
        "Homework": "Worksheet - 1 per week - generally two problems. WileyPlus - 1 assignment/week, generally 12-15 questions, and a review before each exam, about the same length. Canvas - 1 quiz before every lecture, 2 or 3 multiple choice questions. Gradarius(Only for Calc 1) - 1 assignment per week, typically 4 questions, where you show your work online",
        "Final": "4-hours allotted time, generally takes 1.5-2.5 hours"},
    "books": {
        "1": {
            "url": "ma121-124_6e.pdf",
            "name": "Hughes-Hallett Calculus 6th Edition"}},
    "materials": ["WileyPLUS Online Course", "Gradarius Online - only for Calc 1"]},
"CAL105 - Knowledge, Nature, and Culture": {
    "info": {
        "Lecture": "3 hours a week, either as a 2-hour and a 1-hour session or as 3 1-hour sessions. Varies by professor, usually a discussion-based lecture",
        "Recitation": "N/A",
        "Exams": "1 midterm with length varying greatly by professor",
        "Homework": "Varies by professor but generally 3 essays, and 1-2 readings per week with short writing assignments for each",
        "Final": "Time and format varies greatly by professor. Anything from several short questions to an essays"},
    "materials": ["Knowledge, Nature, Culture - and Introduction to the Humanities and Social Sciences - 2nd Edition ---Given to you for free by the school"]},
"CH 281 - Biology": {
    "info": {
        "Lecture": "Twice a week",
        "Recitation": "Once a week. You must know the answers to a set of questions you are given on canvas beforehand and you may be asked to go to the board and answer them",
        "Exams": "3 1-hour exams, 15 percent of final grade each",
        "Homework": "Canvas- Questions you need to know for recitation(1/week) are online on the calendar. You must know the answers to the questions for each recitation, and you must uplaod a picture of your answers to all questions to canvas before the exam on those chapters. Mintap/Aplia- Tutorial Quiz and Aplia assignment for each chapter must be completed by the due dates posted",
        "Final": "4-hours allotted time, 25 percent of final grade"},
    "materials": ["MindTap Online Subscription"]},
"CH 117 - Chemistry Lab": {
    "info": {
        "Lecture": "1 Lab per week, usually about one hour of the three hour time allotment",
        "Exams": "Quizzes at the beginning of each lab",
        "Homework": "Finishing lab reports",
        "Final": "Video of one of the labs"},
    "materials": ["Lab Goggles"],
    "books": {
        "1": {
            "url": "ch117_10e.pdf",
            "name": "Chemistry Lab Manual - This book has all the lab forms and info in it. You need to print them out before every lab, they should also all be available on Canvas"}}},
"MA 188 - Seminar in Math Sciences": {
    "info": {
        "Lecture": "Professor discusses concept in discrete mathematics and example problems",
        "Exams": "Several quizzes to get additional points",
        "Homework": "Problems based on concepts from class, for correctly presenting the solution to the class you get 1 point",
        "Final": "You need 5 points to pass the class for the semester"}},
"MGT103 - Introduction to Entrepreneurial Thinking - \"Intro to Entro\"": {
    "books": {
        "1": {
            "url": "mgt103_2e.pdf",
            "name": "Running Lean 2nd Edition"}}},
"PEP111 - Mechanics": {
    "info": {
        "Lecture": "2 1-hour lectures per week",
        "Recitation": "1 2-hour recitation per week - review of lecture topics and practice problems",
        "Exams": "15 point quizzes every two weeks, you get to drop the lowest grade",
        "Homework": "MasteringPhysics - 1 online assignment/week. Im not going to say there is a javascript code that will give you all the answers... but Im not saying there isnt",
        "Final": "I havent had the final yet"},
    "books": {
        "1": {
            "url": "pep111_3e.pdf",
            "name": "Physics - Knight 3rd Edition"}},
    "materials": ["Mastering Physics Online Subscription"]},
"H  183 - Research Seminar I": {
    "info": {
        "Lecture": "Different professors come and present the research they have done"}},
"CAL103 - Writing and Communications": {
    "info": {
        "Lecture": "3 hours a week, either as a 2-hour and a 1-hour session or as 3 1-hour sessions. Varies by professor, usually a discussion-based lecture",
        "Recitation": "N/A",
        "Exams": "1 midterm with length varying greatly by professor",
        "Homework": "Varies greatly by professor but generally 3 essays, 1 being a research paper, and 1-2 readings per week with short writing assignments for each",
        "Final": "Time and format varies greatly by professor. Anything from several short questions to several essays"},
    "books": {
        "1": {
            "url": "cal103_hacker_6e.pdf",
            "name": "A Pocket Style Manual - Diana Hacker"},
        "2": {
            "url": "cal103.pdf",
            "name": "A World of Ideas"}}},
"E  122 - Engineering Design 2 - \"D2\"": {
    "info": {
        "Lecture": "1 3-hour lecture per week",
        "Final": "Project and report",
        "Homework": "LabView(programming language) assignments he first few weeks"},
    "materials": ["LabView, which is on the laptop the school gives you"]}, "MA 222 - Probability and Statistics for Engineers - \"ProbStats\"": {
        "books": {
            "1": {
                "url": "ma222_8e.pdf",
                "name": "Probability and Statistics for Engineering and the Sciences - Devore 8th Edition"}}},
"CS 188 - Seminar in Computer Science": {
    "info": {
        "Lecture": "Students present on controversial/interesting technology",
        "Homework": "Prepare your presentation for the class"}}}
